Revit 2027 API
IndexStreamTriangle Methods
The IndexStreamTriangle type exposes the following members.
Methods
Name | Description
AddTriangle |  Inserts a IndexTriangle into the stream and associated buffer.
AddTriangles |  Inserts multiple IndexTriangle instances into the stream and associated buffer.
Dispose
(Inherited from IndexStream)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IndexStreamTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace